/*
  @file  ResultParamete.cpp
  @brief リザルトパラメータークラス
*/
#include "pch.h"
#include "ResultParamete.h"

//---------------------------------------------------------
// コンストラクタ
//---------------------------------------------------------
ResultParamete::ResultParamete()
	:
	m_score{0},
	m_remainingNumber{10}
{
	LoadResultParamete();
}

//---------------------------------------------------------
// デストラクタ
//---------------------------------------------------------
ResultParamete::~ResultParamete()
{
}

//---------------------------------------------------------
// ジェイソンから読み取る
//---------------------------------------------------------
void ResultParamete::LoadResultParamete()
{
}
